load-tests/scenario-flow.yml
config:
  # Default fallback target
  target: "http://localhost:3000"
  environments:
    local:
      target: "http://localhost:3000"
    production:
      target: "https://{{ $processEnvironment.DEPLOY_DOMAIN }}/api/users"
  processor: "./processor.js"
  phases:
    - duration: 15
      arrivalRate: 2
      name: "Warm up"
    - duration: 30
      arrivalRate: 5
      name: "Sustained load"
    - duration: 20
      arrivalRate: 15
      name: "Peak load"
scenarios:
  - name: "Full Flow: Register, Login, and Play against Bot"
    flow:
      # 1. Generate user variables
      - function: "generateUserData"

      # 2. Check if user exists
      - get:
          url: "/exists/{{ username }}"

      # 3. Register the user
      - post:
          url: "/createuser"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
            is_test: true
      
      # 4. Login to obtain JWT
      - post:
          url: "/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "jwt_token"

      # 5. Create a new game against a Bot (Random strategy)
      - post:
          url: "/games"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          json:
            board_size: 5
            strategy: "random"
            game_type: "BOT"
          capture:
            - json: "$._id"
              as: "gameId"
            - json: "$.current_turn"
              as: "firstTurn"
      
      # 6. If it's Bot's turn ('R'), Bot plays first
      - get:
          url: "/games/{{ gameId }}/play"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          ifTrue: "firstTurn == 'R'"

      # 7. Player makes a move (now it's always their turn)
      - post:
          url: "/games/{{ gameId }}/move"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          json:
            coordinates:
              x: 4
              y: 0
              z: 0

      # 8. Request the Bot to play (after player move)
      - get:
          url: "/games/{{ gameId }}/play"
          headers:
            Authorization: "Bearer {{ jwt_token }}"

      # 9. Cleanup: Delete the test user
      - delete:
          url: "/deleteuser"
          headers:
            Authorization: "Bearer {{ jwt_token }}"